experiments/results/logs/periodic-hybrid-007/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5787.320ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5688.053ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5732.577ms, rate sampling interval: 17547ms
  Thread calibration: mean lat.: 6189.813ms, rate sampling interval: 15728ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.60m     1.81m    7.23m    70.81%
    Req/Sec     6.63      3.34    13.00     81.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.19m 
 75.000%    5.86m 
 90.000%    6.46m 
 99.000%    7.10m 
 99.900%    7.18m 
 99.990%    7.21m 
 99.999%    7.23m 
100.000%    7.23m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8351.743     0.000000            1         1.00
   84672.511     0.100000         1677         1.11
  181534.719     0.200000         3352         1.25
  252313.599     0.300000         5028         1.43
  288882.687     0.400000         6723         1.67
  311689.215     0.500000         8390         2.00
  320864.255     0.550000         9222         2.22
  328990.719     0.600000        10063         2.50
  336855.039     0.650000        10900         2.86
  344195.071     0.700000        11771         3.33
  351797.247     0.750000        12585         4.00
  356253.695     0.775000        13014         4.44
  360972.287     0.800000        13417         5.00
  366739.455     0.825000        13833         5.71
  373293.055     0.850000        14259         6.67
  380108.799     0.875000        14677         8.00
  383516.671     0.887500        14875         8.89
  387448.831     0.900000        15088        10.00
  391905.279     0.912500        15308        11.43
  395575.295     0.925000        15507        13.33
  400293.887     0.937500        15724        16.00
  403177.471     0.943750        15832        17.78
  406061.055     0.950000        15924        20.00
  409206.783     0.956250        16029        22.86
  412090.367     0.962500        16136        26.67
  414973.951     0.968750        16241        32.00
  416284.671     0.971875        16291        35.56
  418119.679     0.975000        16350        40.00
  419954.687     0.978125        16398        45.71
  421527.551     0.981250        16448        53.33
  423100.415     0.984375        16503        64.00
  423886.847     0.985938        16534        71.11
  424673.279     0.987500        16560        80.00
  425459.711     0.989062        16580        91.43
  425983.999     0.990625        16613       106.67
  426770.431     0.992188        16636       128.00
  427294.719     0.992969        16644       142.22
  427819.007     0.993750        16671       160.00
  427819.007     0.994531        16671       182.86
  428605.439     0.995313        16691       213.33
  428867.583     0.996094        16703       256.00
  428867.583     0.996484        16703       284.44
  429654.015     0.996875        16716       320.00
  429654.015     0.997266        16716       365.71
  429916.159     0.997656        16727       426.67
  430178.303     0.998047        16729       512.00
  430702.591     0.998242        16741       568.89
  430702.591     0.998437        16741       640.00
  430702.591     0.998633        16741       731.43
  430702.591     0.998828        16741       853.33
  430964.735     0.999023        16745      1024.00
  431489.023     0.999121        16749      1137.78
  431489.023     0.999219        16749      1280.00
  431489.023     0.999316        16749      1462.86
  431751.167     0.999414        16753      1706.67
  431751.167     0.999512        16753      2048.00
  431751.167     0.999561        16753      2275.56
  432013.311     0.999609        16755      2560.00
  432013.311     0.999658        16755      2925.71
  432799.743     0.999707        16758      3413.33
  432799.743     0.999756        16758      4096.00
  432799.743     0.999780        16758      4551.11
  432799.743     0.999805        16758      5120.00
  432799.743     0.999829        16758      5851.43
  432799.743     0.999854        16758      6826.67
  432799.743     0.999878        16758      8192.00
  433586.175     0.999890        16759      9102.22
  433586.175     0.999902        16759     10240.00
  433586.175     0.999915        16759     11702.86
  433586.175     0.999927        16759     13653.33
  433586.175     0.999939        16759     16384.00
  433848.319     0.999945        16760     18204.44
  433848.319     1.000000        16760          inf
#[Mean    =   276186.529, StdDeviation   =   108515.826]
#[Max     =   433586.176, Total count    =        16760]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16964 requests in 10.00m, 173.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 13268
Requests/sec:     28.27
Transfer/sec:    296.80KB